src/Catalogs/Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>communication_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>communication_type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращенийCoMagic</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ct_cid</Name>
					<Comment>Calltouch Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fbp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fitness1c_cid</Name>
					<Comment>Для быстрого получения УИД контрагента в отчетах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ga_cid</Name>
					<Comment>Google Analitics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_cid</Name>
					<Comment>Roistat Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rs_vid</Name>
					<Comment>Roistat Visit ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>user_agent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_campaign</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_medium</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_source</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>utm_term</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ym_cid</Name>
					<Comment>Yandex Metrics Client ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Comment>РекламнаяПлощадка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентИзВиджетаЛК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОценкиКачестваЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчаствоватьВРассылке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияСтатусов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходИзСтатуса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходВСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/СпискиВыбораВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализировать представление списка
//
// Параметры:
//  СписокВыбораЗначений	 - 	 - 
//  МассивЗначений			 - 	 - 
//  ВыводитьНомерТелефона	 - 	 - 
//
Процедура ИнициализироватьПредставлениеСписка(СписокВыбораЗначений, МассивЗначений, ВыводитьНомерТелефона = Истина) Экспорт 
	
	МассивКонтрагентов 	= Новый Массив;
	МассивЗаявок 		= Новый Массив;
	МассивСделок 		= Новый Массив;
	МассивСтрок 		= Новый Массив;
	
	ОбновлениеСписка = НЕ СписокВыбораЗначений.Количество() = 0;
	
	Для Каждого ЭлементМассива Из МассивЗначений Цикл 
		Если ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Контрагенты") Тогда 
			МассивКонтрагентов.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Заявки") Тогда 
			МассивЗаявок.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("СправочникСсылка.Сделки") Тогда 
			МассивСделок.Добавить(ЭлементМассива);
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("Строка") Тогда 
			МассивСтрок.Добавить(ЭлементМассива); 	
	    КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивСтрок) Тогда 
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			МассивФорматированныхСтрок = Новый Массив;
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлементМассива + Символы.Таб + Символы.Таб, Новый Шрифт("Arial", 10), Новый Цвет(74, 74, 74)));
			МассивФорматированныхСтрок.Добавить(Новый ФорматированнаяСтрока("  -  история вводимых значений", Новый Шрифт("Arial", 10), Новый Цвет(193, 193, 193)));
			Представление = Новый ФорматированнаяСтрока(МассивФорматированныхСтрок); 			
			Если ОбновлениеСписка Тогда
				СписокВыбораЗначений.Вставить(0, ЭлементМассива, Представление);			
			Иначе 
				СписокВыбораЗначений.Добавить(ЭлементМассива, Представление);			
			КонецЕсли;	
		КонецЦикла;				
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Если ЗначениеЗаполнено(МассивКонтрагентов) Тогда
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Контрагенты"));
		Если МассивКонтрагентов.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивКонтрагентов)", "= &КонтрагентСсылка");
			Запрос.УстановитьПараметр("КонтрагентСсылка", МассивКонтрагентов[0]);			
		Иначе 	
			Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивЗаявок) Тогда 
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Заявки"));
		Если МассивЗаявок.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивЗаявок)", "= &ЗаявкаСсылка");
			Запрос.УстановитьПараметр("ЗаявкаСсылка", МассивЗаявок[0]);			
		Иначе 			
			Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивСделок) Тогда 
		ИнициализироватьТекстЗапроса(Запрос, Тип("СправочникСсылка.Сделки"));
		Если МассивСделок.Количество() = 1 Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "В(&МассивСделок)", "= &СделкаСсылка");
			Запрос.УстановитьПараметр("СделкаСсылка", МассивСделок[0]);			
		Иначе 					
			Запрос.УстановитьПараметр("МассивСделок", МассивСделок);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
		ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
		Если ТаблицаОбъектов.Количество() = 0 И НЕ ОбновлениеСписка Тогда 
			СписокВыбораЗначений.ЗагрузитьЗначения(МассивЗначений);
		Иначе
			//СписокВыбораЗначений.Очистить();
			Для Каждого ЭлементМассива Из МассивЗначений Цикл 
				СтрокаТаблицы = ТаблицаОбъектов.Найти(ЭлементМассива, "СсылкаНаОбъект");
				Если НЕ СтрокаТаблицы = Неопределено Тогда  
					Если ТипЗнч(СтрокаТаблицы.СсылкаНаОбъект) = Тип("СправочникСсылка.Заявки") Тогда
						ЗаголовокНаименования = "Заявка № " + ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СтрокаТаблицы.КодОбъекта, "");
						Представление = ЗаголовокНаименования + ": " + СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда 
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(ЗаголовокНаименования + ": "), Новый Цвет(0, 112, 210)));								
						Иначе 	
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(ЗаголовокНаименования + ": "), Новый Цвет(0, 112, 210)));								
						КонецЕсли;	
					ИначеЕсли ТипЗнч(СтрокаТаблицы.СсылкаНаОбъект) = Тип("СправочникСсылка.Сделки") Тогда 
						Представление = СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ": " + СокрЛП(СтрокаТаблицы.НаименованиеКонтрагента) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(СтрокаТаблицы.НаименованиеОбъекта + ": "), Новый Цвет(139, 0, 0)));						
						Иначе 	
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, "", СокрЛП(СтрокаТаблицы.НаименованиеОбъекта + ": "), Новый Цвет(139, 0, 0)));						
						КонецЕсли;	
					Иначе 	
						Представление = "" + СокрЛП(СтрокаТаблицы.НаименованиеОбъекта) + ?(ВыводитьНомерТелефона, ?(ЗначениеЗаполнено(СтрокаТаблицы.Телефон), "  тел.:" + СтрокаТаблицы.Телефон,""), "");
						Если ОбновлениеСписка Тогда
							СписокВыбораЗначений.Вставить(0, СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, ""));			
						Иначе 
							СписокВыбораЗначений.Добавить(СтрокаТаблицы.СсылкаНаОбъект, ВернутьФорматированнуюСтрокуПоиска(Представление, ""));			
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли НЕ ОбновлениеСписка Тогда 
		СписокВыбораЗначений.ЗагрузитьЗначения(МассивЗначений);		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать текст запроса
//
// Параметры:
//  Запрос		 - 	 - 
//  ТипОбъекта	 - 	 - 
//
Процедура ИнициализироватьТекстЗапроса(Запрос, ТипОбъекта)
	
	Если ТипОбъекта = Тип("СправочникСсылка.Контрагенты") Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Контрагенты.Ссылка КАК СсылкаНаОбъект,
		               |	Контрагенты.Наименование КАК НаименованиеОбъекта,
		               |	Контрагенты.Код КАК КодОбъекта,
		               |	Контрагенты.Ссылка КАК Контрагент,
		               |	Контрагенты.Наименование КАК НаименованиеКонтрагента,					   
		               |	Контрагенты.Фамилия КАК Фамилия,
		               |	Контрагенты.Имя КАК Имя,
		               |	Контрагенты.Отчество КАК Отчество,
		               |	Контрагенты.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.Ссылка В(&МассивКонтрагентов)";
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Заявки") Тогда 
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
			Запрос.Текст = Запрос.Текст + "
		               |	
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Заявки.Ссылка,
		               |	Заявки.Наименование,
		               |	Заявки.Код,
		               |	Заявки.ОсновнойКлиент,
		               |	Заявки.ОсновнойКлиент.Наименование,					   
		               |	Заявки.ОсновнойКлиент.Фамилия,
		               |	Заявки.ОсновнойКлиент.Имя,
		               |	Заявки.ОсновнойКлиент.Отчество,
		               |	Заявки.ОсновнойКлиент.Телефон
		               |ИЗ
		               |	Справочник.Заявки КАК Заявки
		               |ГДЕ
		               |	Заявки.Ссылка В(&МассивЗаявок)";
		Иначе 	
			Запрос.Текст = Запрос.Текст + "
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Заявки.Ссылка КАК СсылкаНаОбъект,
		               |	Заявки.Наименование КАК НаименованиеОбъекта,
		               |	Заявки.Код КАК КодОбъекта,
		               |	Заявки.ОсновнойКлиент КАК Контрагент,
		               |	Заявки.ОсновнойКлиент.Наименование КАК НаименованиеКонтрагента,					   
		               |	Заявки.ОсновнойКлиент.Фамилия КАК Фамилия,
		               |	Заявки.ОсновнойКлиент.Имя КАК Имя,
		               |	Заявки.ОсновнойКлиент.Отчество КАК Отчество,
		               |	Заявки.ОсновнойКлиент.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Заявки КАК Заявки
		               |ГДЕ
		               |	Заявки.Ссылка В(&МассивЗаявок)";
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Сделки") Тогда 
		
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда 
			Запрос.Текст = Запрос.Текст + "
		               |	
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Сделки.Ссылка,
		               |	Сделки.Наименование,
		               |	Сделки.Код,
		               |	Сделки.Контрагент,
		               |	Сделки.Контрагент.Наименование,					   
		               |	Сделки.Контрагент.Фамилия,
		               |	Сделки.Контрагент.Имя,
		               |	Сделки.Контрагент.Отчество,
		               |	Сделки.Контрагент.Телефон
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.Ссылка В(&МассивСделок)";
		Иначе 	
			Запрос.Текст = Запрос.Текст + "
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Сделки.Ссылка КАК СсылкаНаОбъект,
		               |	Сделки.Наименование КАК НаименованиеОбъекта,
		               |	Сделки.Код КАК КодОбъекта,
		               |	Сделки.Контрагент КАК Контрагент,
		               |	Сделки.Контрагент.Наименование КАК НаименованиеКонтрагента,					   
		               |	Сделки.Контрагент.Фамилия КАК Фамилия,
		               |	Сделки.Контрагент.Имя КАК Имя,
		               |	Сделки.Контрагент.Отчество КАК Отчество,
		               |	Сделки.Контрагент.Телефон КАК Телефон
		               |ИЗ
		               |	Справочник.Сделки КАК Сделки
		               |ГДЕ
		               |	Сделки.Ссылка В(&МассивСделок)";
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Вернуть форматированную строку поиска
//
// Параметры:
//  СтрокаДляРазбора - 	 - 
//  СтрокаПоиска	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьФорматированнуюСтрокуПоиска(Знач СтрокаДляРазбора, Знач СтрокаПоиска, СтрокаЗаголовокНаименованияОбъектаCRM = Неопределено, ЦветЗаголовкаОбъектаCRM = Неопределено) Экспорт
	
	Если СтрокаЗаголовокНаименованияОбъектаCRM <> Неопределено Тогда 
		СтрокаДляРазбораБезСделки = СокрЛП(СтрЗаменить(СтрокаДляРазбора, СтрокаЗаголовокНаименованияОбъектаCRM, ""));
	Иначе 	
		СтрокаДляРазбораБезСделки = СтрокаДляРазбора;
	КонецЕсли;
	
	СтрокаВВерхнемРегистре = Врег(СтрокаДляРазбораБезСделки);
	СтрокаПоискаВВерхнемРегистре = Врег(СтрокаПоиска);
	
	ФормСтрока = Новый Массив;
	Для Стр = 1 По СтрЧислоВхождений(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре) Цикл
		Индекс = Найти(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре);
		Если НЕ Индекс = 1 Тогда 
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбораБезСделки,1,Индекс-1)));
		КонецЕсли;
		ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбораБезСделки, Индекс, СтрДлина(СтрокаПоиска)), Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
		СтрокаДляРазбораБезСделки = Прав(СтрокаДляРазбораБезСделки, СтрДлина(СтрокаДляРазбораБезСделки) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
		СтрокаВВерхнемРегистре = Прав(СтрокаВВерхнемРегистре, СтрДлина(СтрокаВВерхнемРегистре) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	КонецЦикла;
	
	ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаДляРазбораБезСделки));
	Если СтрокаЗаголовокНаименованияОбъектаCRM <> Неопределено Тогда
		Если ЦветЗаголовкаОбъектаCRM = Неопределено Тогда 
			ЦветЗаголовкаОбъектаCRM = Новый Цвет;
		КонецЕсли;	
		ФормСтрока.Вставить(0, Новый ФорматированнаяСтрока(СтрокаЗаголовокНаименованияОбъектаCRM + " ", Новый Шрифт(, , Истина), ЦветЗаголовкаОбъектаCRM));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ФормСтрока);
	
	////------------------------------------------------------------------------------------------
	//СтрокаВВерхнемРегистре = Врег(СтрокаДляРазбора);
	//СтрокаПоискаВВерхнемРегистре = Врег(СтрокаПоиска);
	//
	//ФормСтрока = Новый Массив;
	//Для Стр = 1 По СтрЧислоВхождений(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре) Цикл
	//	Индекс = Найти(СтрокаВВерхнемРегистре, СтрокаПоискаВВерхнемРегистре);
	//	Если НЕ Индекс = 1 Тогда 
	//		ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбора,1,Индекс-1)));
	//	КонецЕсли;
	//	ФормСтрока.Добавить(Новый ФорматированнаяСтрока(Сред(СтрокаДляРазбора, Индекс, СтрДлина(СтрокаПоиска)), Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
	//	СтрокаДляРазбора = Прав(СтрокаДляРазбора, СтрДлина(СтрокаДляРазбора) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	//	СтрокаВВерхнемРегистре = Прав(СтрокаВВерхнемРегистре, СтрДлина(СтрокаВВерхнемРегистре) - (Индекс + (СтрДлина(СтрокаПоиска)-1)));
	//КонецЦикла;
	//ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаДляРазбора));
	//
	//Возврат Новый ФорматированнаяСтрока(ФормСтрока);

КонецФункции

#КонецОбласти
